Revit 2027 API
UnitSystem Enumeration
 A system of measurement: Metric or Imperial units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum UnitSystem
Public Enumeration UnitSystem
public enum class UnitSystem
type UnitSystem
Members
Member name | Value | Description
Imperial | 1 |  Imperial units.
Metric | 0 |  Metric units.
See Also
Reference
Autodesk.Revit.DB Namespace